print('Задача 2. Должники')

# Должники и законопослушные граждане хранятся в одной базе банка.
# Из этой базы нам выделяются по 10 человек, у каждого из которых есть свой номер.
# Правда, иногда база глючит и выдаёт нам отрицательный номер.
# А ещё по статистике, которую собрал наш МирПрогБанк, 
# каждый второй, кто в этом году брал кредит, не выплатил его вовремя.
# 
# Пользователь вводит 10 чисел.
# Напишите программу,
# которая определяет, сколько из них являются одновременно четными и положительными.
for every_number in range(1,11):
    current_number = int(input(f"Введите {every_number} число: "))
    if current_number % 2 ==0 and current_number > 0:
        print(f"{current_number} Число подходит")
    else:
        print(f"{current_number} Число не подходит")